//Є метод, який приймає масив слів, і робить із них рядок, розділяючи слова пробілами. При цьому слова перетворюються.
//        Якщо слово довше ніж 3 символи, воно наводиться в нижній регістр. Інакше воно наводиться у верхній регістр.
//Програма працює правильно, але повільно. Якщо дати їй на вхід масив завдовжки десятки тисяч рядків, це буде помітно.
////        Це відбувається через конкатенацію рядків у циклі.
//Перепиши існуючий код класу PhraseMaker з використанням класу StringBuilder,
//        щоб позбутися конкатенації рядків у циклі. В іншому програма повинна працювати так само.
public class PhraseMakerTest {
    public static void main(String[] args) {
        String[] words = {"Life", "is", "great", "thing"};

        //life IS great thing
        System.out.println(new PhraseMaker().join(words));
    }
}