//Напиши клас для опису головного героя гри - Hero. У цього класу мають бути два поля:
//        поле name рядкового типу. У цьому полі зберігатиметься ім'я головного героя;
//        поле hp типу int. Тут зберігатиметься кількість очок здоров'я, що залишилися.
//        У класі Hero також допиши конструктор без параметрів, який ініціалізуватиме поле name значенням "Paratrooper", а поле hp - значенням 100.
//        Для полів name та hp напиши геттери, сеттери писати необов'язково.
//        виконання коду new Hero().getName() повертає Paratrooper;
//        виконання коду new Hero().getHp() повертає 100
//        поля name та hp ініціалізуються у конструкторі
//Допиши у класі Hero конструктор, який приймає два параметри - ім'я головного героя, та кількість його життів. Задай полям name та hp значення цих параметрів.
//        Не видаляй конструктор за замовчуванням, він повинен працювати так, як і працював раніше.
//        виклик new Hero().getName() повертає Paratrooper;
//        виклик new Hero("Stranger", 50).getName() повертає Stranger.
//Зроби рефакторинг коду. Перепиши конструктор Hero() без параметрів так, щоб він викликав конструктор Hero(String, int)
// з параметрами, використовуючи ключове слово this.
//        В іншому поведінка програми не повинна змінитися.
//        виклик new Hero().getName() повертає Paratrooper;
//        виклик new Hero("Stranger", 50).getName() повертає Stranger.
//        у конструкторі без параметрів викликається конструктор із параметрами, використовуючи ключове слово this
//Допиши конструктор Hero(String, int) так, щоб він обмежував значення поля hp діапазоном від 0 до 200 включно.
//        виклик new Hero("Stranger", 250).getHp() повертає 200
//        виклик new Hero().getHp() повертає 100
public class HeroTest {
    public static void main(String[] args) {
        Hero hero = new Hero();
        Hero hero1 = new Hero("Stranger", 250);

        //Expect Paratrooper
        System.out.println(hero.getName());
        //Expect 100
        System.out.println(hero.getHp());

        System.out.println(hero1.getName());
        System.out.println(hero1.getHp());
    }
}